window.tips_data = {}
window.tips_data.intro = ["مرحبا في موقع اوتار.\n" +
                  "تستطيع عن طريق الموقع ان تعزف على المقامات الموسيقية العربية. \nلنأخذ جولة سريعة لنتعلم كيفية استخدام الموقع"
                  ,"في الوسط عندنا ازرار العزف و نستطيع من خلالها عزف اي نغمة عن طريق الضغط على ازرار الكيبورد\n"                                     
,"جرب مثلا الضغط على زر E ثم زر R "

,"هناك ثلاثة صفوف من الازرار، كل صف يمثل اوكتيف او ديوان"
,"الزر E هو النغمة الاولى في المقام في الديوان الثاني"
,"كل صف يحتوي على ازرار اضافية تمثل نغمات من الديوان السابق و الديوان اللاحق من اجل سهولة الانتقال بين الطبقات"
,"على سبيل المثال، الزر W يعطي نفس نغمة الزر 9 "
,"جرب الان ان تضط على زر W  ثم الضغط على زر 9 ولاحظ تطابق النغمة"
,"لاحظ ايضا انك حين تضغط زر W يظهر زر 9 و كأنه نصف مضغوط"
,"جرب الضغط على زر Q و لاحظ ما يحدث للزر 8"
,"على اليمين عندنا قائمة بالمقامات، حين تضغط على مقام معين فإن لوحة المفاتيح تتأقلم مع المقام. جرب تغيير المقام الى مقام بياتي"
,"لاحظ تغير العنوان فوق لوحة المقاتيح الى مقام البياتي. هذا العنوان دائما يخبرك ما هو المقام الحالي"
,"المقام يحدد لنا نغمات السلم الموسيقي. جرب الان ان تعزف اول اربع نغمات من المقام - مقام البياتي عن طريق الضغط على ازرار E ثم R ثم T ثم Y"
,"جرب الان تغيير المقام الى مقام العجم و اعزف اول اربع نغمات ايضا عن طريق الضغط على الازرار E ثم R ثم T ثم Y"
,"لاحظ تغير النغمات الناتجة عن لوحة المفاتيح بحسب المقام الحالي"
,"الى هنا تنتهي جولتنا السريعة مع البرنامج، \n\n تستطيع الان العزف على اي مقام من المقامات الموجودة في القائمة اليمنى!!!\n\nعزفا ممتعا!"
];
