window.tips_data = {}
window.tips_data.basic_usage = [ "في الوسط عندنا ازرار العزف و نستطيع من خلالها عزف اي نغمة عن طريق الضغط على ازرار الكيبورد اي لوحة المفاتيح في حاسوبك"                                     
,"لاحظ توافق ترتيب الازرار على الشاشة مع ترتيب الازرار في لوحة المفاتيح. تم تصميم هذه الازرار لكي تكون مشابهة لازرار البيانو بحيث تتسلسل النغمات من اليسار الى اليمين"
,"جرب مثلا الضغط على زر E ثم زر R، ثم استمر بالانتقال الى الازرار التالية واستمع الى النغمات الناتجة "

,"هناك ثلاثة صفوف من الازرار، كل صف يمثل اوكتيف او ديوان"
,"الزر E هو النغمة الاولى في المقام في الديوان الثاني"
,"كل صف يحتوي على ازرار اضافية تمثل نغمات من الديوان السابق و الديوان اللاحق من اجل سهولة الانتقال بين الطبقات"
,"على سبيل المثال، الزر W يعطي نفس نغمة الزر 9 جرب ان تضط على زر W  ثم على زر 9 ولاحظ تطابق النغمة"
,"لاحظ ايضا انك حين تضغط زر W يظهر زر 9 و كأنه نصف مضغوط، \n جرب الضغط على زر Q و لاحظ ما يحدث للزر 8"
,"على اليمين عندنا قائمة بالمقامات، حين تضغط على مقام معين فإن لوحة المفاتيح تتأقلم مع المقام. جرب تغيير المقام الى مقام بياتي"
,"لاحظ تغير العنوان فوق لوحة المقاتيح الى مقام البياتي. هذا العنوان دائما يخبرك ما هو المقام الحالي"
,"المقام يحدد لنا نغمات السلم الموسيقي. جرب الان ان تعزف اول اربع نغمات من المقام - مقام البياتي عن طريق الضغط على ازرار E ثم R ثم T ثم Y"
,"جرب الان تغيير المقام الى مقام العجم و اعزف اول اربع نغمات ايضا عن طريق الضغط على الازرار E ثم R ثم T ثم Y"
,"لاحظ تغير النغمات الناتجة عن لوحة المفاتيح بحسب المقام الحالي"
];

intro = "مرحبا في موقع اوتار، \n\n تستطيع عن طريق الموقع ان تعزف على المقامات الموسيقية العربية،،  \n\n سوف نأخذ جولة سريعة لنتعلم كيفية استخدام الموقع";

outro = [
"الى هنا تنتهي جولتنا السريعة مع البرنامج، \n\n في الاسفل هناك ازرار اخرى من اجل المزيد من المعلومات حول جوانب اضافية من الموقع"
,"تستطيع الان العزف على اي مقام من المقامات الموجودة في القائمة اليمنى!!!\n\nعزفا ممتعا!"
];

window.tips_data.intro = [intro].concat(tips_data.basic_usage).concat(outro);

window.tips_data.notes = [
"يتكون السلم الموسيقي من سبع نغمات، و في هذا الموقع نستخدم النظام الاوروبي لتمسية هذه النغمات: دو ري مي فا صول لا سي"
,"كل نغمة لها تردد معين، و هناك نسبة رياضية بين تردد كل نعمة و اخرى، فمثلا على مقام العجم، تردد نغمة ري نسبته الى تردد نغمة دو هو 9/8 اي تسعة الى ثمانية، و هذا البعد يسمى البعد الطنيني"
,"الموسيقى الغربية الحديثة تقسم السلم الموسيقي الى 12 قسما متساويا اي ان الاوكتاف يتكون من 12 بعدا و يسمون المسافة بين كل بعد و اخر نصف تون"
,"حين قمنا بقليل من الدراسة و البحث حول المقامات العربية وجدنا ان هذا النظام غير مناسب ابدا للمقامات العربية الاصلية، و لهذا فقد تبنينا النظام التركي اللذي يقسم الديوان الى 53 بعدا، بحيث تكون كل 9 ابعاد هي بعد طنيني، و كل اربعة ابعاد هي بعد نصف طنيني"
,"هذا يعني ان هذه الابعاد فيها اختلاف بسيط عن ابعاد السلم الغربي، و لكنها اكثر ملائمة للنغم العربي و اقرب الى الابعاد الرياضية الحقيقية، فالبعد الطنيني في السلم الغربي الحديث هو في الحقيقة اقل من البعد الطنيني الحقيقي اللذي نسبته تسعة الى ثمانية"
,"هناك اختلاف اخر في هذا الموقع عن النمط الغربي و هو في ضبط النغمات، حيث قمنا بضبط تردد نغمة الدو على تردد 128 هرتز و هو اقل قليلا من التردد المستخدم في الموسيقى الغربية و اللذي هو 130.81"
,"تضبيط النغمات في الموسيقى الغربية يعتمد اساسا على ضبط نغمة لا على تردد 220 و لكن في موقعنا فإن نغمة لا على مقام العجم يصبح ترددها 215.97 يعني اقل قليلا من التردد الموجود في سلم الدو ماجور الغربي"
,"اذا دققت النظر في لوحة المفاتيح على الموقع ستجد كل زر عليه رقم، هذا الرقم يمثل بعد النغمة عن مفتاح الدو، و هذا البعد وحدة قياسه هي اجزاء السلم الموسيقي اللذي قسمناه الى 53 جزئا، كما قلنا، على نمط النظام الموسيقي التركي"
,"بعض النغمات تختلف قليلا من مقام الى اخر، فمثلا نغمة المي على مقام الرست درجتها اقل قليلا من نغمة المي على مقام العجم، و يمكن ملاحظة ذلك حيث ان نغمة مي على مقام العجم عليها رقم 18 بينما على مقام الرست على رقم 16"
,"اذن اسماء النغمات (دو ري مي ..)ليست مطلقة، بل نسبية، وهي لا تشير دئما الى تردد معين بل يمكن احيانا ان تكون النغمة اعلى قليلا او اخفض قليلا و لكننا نظل نسميها بنفس الاسم"
,"سنقوم قريبا بنشر مقال نوضح فيه هذه الامور بشكل اكبر! فانتظرونا هناك!"
];

